posts/Coding/2016-04-09-Continuous-Time-Markov-Chain.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-10 Sat 17:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A simulator for continuous-time Markov chains</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dominik Schrempf" />
<meta name="description" content="Simulate a continuous time Markov chain with any transition rate matrix."
 />
<meta name="keywords" content="CTMC, Markov Chain, Continuous-Time Markov Chain" />
<link rel='stylesheet' href='/css/site.css' type='text/css'/>
<meta name="viewport" content="width=device-width"/>
</head>
<body>
<div id="preamble" class="status">
<div class='nav'>
<ul>
<li><a href='/'>Home</a></li>
<li><a href='/archive.html'>Archive</a></li>
<li><a href='http://github.com/dschrempf'>GitHub</a></li>
</ul>
</div>
</div>
<div id="content">
<h1 class="title">A simulator for continuous-time Markov chains</h1>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2016-04-09 Sat] </span></span> I extended <a href="2015-03-26-PopGen-CPP-Programs.html">my set of C++ programs</a> to include a
simulator for generic continuous-time Markov chains.  I.e., any
transition rate matrix can be used.
</p>

<p>
If you are interested, just get the <a href="https://github.com/dschrempf/popgen-cpp-programs">GitHub repository</a> and compile the
whole set of programs with <code>make all</code>.  Documentation can be found in
the <code>doc/</code> folder (check the <code>CTMC</code> class).
</p>

<p>
There is a sample program <code>src/moran_model_boundary_mutation</code>, that
runs the Moran model with boundary mutation (De Maio, N., Schrempf,
D., &amp; Kosiol, C. (2015). PoMo: An Allele Frequency-Based Approach for
Species Tree Estimation. Systematic Biology, 64(6),
1018–1031. <a href="10.1093/sysbio/syv048">10.1093/sysbio/syv048</a>).
</p>

<p>
Using the chain is as easy as:
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Define a GNU Scientific Library Matrix object.</span>
<span style="color: #ce537a; font-weight: bold;">gsl_matrix</span> * <span style="color: #7590db;">my_transition_rate_matrix</span> = alloc_and_set_matrix<span style="color: #4f97d7;">()</span>;
<span style="color: #ce537a; font-weight: bold;">CTMC</span> <span style="color: #bc6ec5; font-weight: bold;">my_chain</span><span style="color: #4f97d7;">(</span>my_transition_rate_matrix, number_of_states<span style="color: #4f97d7;">)</span>;
my_chain.run<span style="color: #4f97d7;">(</span>a_specific_time<span style="color: #4f97d7;">)</span>;

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Now we print some output.</span>
my_chain.print_hitting_times<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">std</span>::cout<span style="color: #4f97d7;">)</span>;
my_chain.print_invariant_distribution<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">std</span>::cout<span style="color: #4f97d7;">)</span>;
</pre>
</div>

<p>
If you want to log the path of the chain, you have to activate the log
path upon initialization:
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #ce537a; font-weight: bold;">CTMC</span> <span style="color: #7590db;">my_chain</span><span style="color: #4f97d7;">(</span>my_transition_rate_matrix, number_of_states, <span style="color: #a45bad;">true</span><span style="color: #4f97d7;">)</span>;

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Print the path.</span>
my_chain.print_path<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">std</span>::cout<span style="color: #4f97d7;">)</span>;
</pre>
</div>
<p>
Logging the path is disabled by default because it uses a lot of
memory.
</p>
</div>
<div id="postamble" class="status">
<div id='disqus_thread'></div>
<script>
    var disqus_config = function () {
        this.page.identifier = '(A simulator for continuous-time Markov chains)';
    };
    (function() {
        var d = document, s = d.createElement('script');

        s.src = '//dschrempf.disqus.com/embed.js';

        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>
<noscript>Please enable JavaScript to view the <a href='https://disqus.com/?ref_noscript' rel='nofollow'>comments powered by Disqus.</a></noscript><p>Copyright 2015-2018 Dominik Schrempf</p>
<p>Last updated <span class="timestamp-wrapper"><span class="timestamp">2018-02-10</span></span></p>
<p>Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="https://orgmode.org">Org</a> mode 9.1.6) </p>
<p><a href="http://validator.w3.org/check?uri=referer">Validate</a> HTML</p>
</div>
</div>
</body>
</html>
